---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanactiveDirn1
source: html/fe65cf9f-75a0-098d-850d-7fa949948192.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanactiveDirn1 Property

"Bars In Major Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpanactiveDirn1 { get; }
```